<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Google Filestream and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.lucaoonk.munki.CloudcarrierTeamviewerQS</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Cloudcarrier-TeamViewer-QS</string>
		<key>NAME</key>
		<string>Teamviewer QS</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>TeamViewer</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>AutoImport</string>
			</array>
			<key>description</key>
			<string>Teamviewer QS</string>
			<key>developer</key>
			<string>TeamViewer</string>
			<key>display_name</key>
			<string>Teamviewer QS</string>
			<key>minimum_os_version</key>
			<string>10.7</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.lucaoonk.download.CloudcarrierTeamviewerQS</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/TeamViewerQS.app</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>