<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Teamviewer-QS-CLCA.</string>
    <key>Identifier</key>
    <string>com.github.lucaoonk.download.Teamviewer-QS-CLCA</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Teamviewer-QS-CLCA</string>
        <key>DOWNLOAD_URL</key>
        <string>https://customdesign.teamviewer.com/download/version_15x/cyzqem3_mac/TeamViewerQS.zip</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <!-- <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>exepected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Google, Inc. (EQHXZ8M8AV)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>